using UnityEngine;

public class ScriptScripta : MonoBehaviour
{
    //ОБНОВЛЕНИЕ ОТ 07.01.2023
    //ЭТОТ СКРИПТ НИЧЕГО НЕ ЗНАЧИТ, ВЕДЬ ЧТОБЫ ЗАЛИТЬ КОД НА RUSTORE НЕОБХОДИМО МНОГО НЕПОНЯТНОГО КОДА
    //ПО ЭТОМУ УВАЖАЕМЫЕ МОДЕРАТОРЫ, ПОФИКСИТЕ ЭТО ПРАВИЛО
    //Я ДОБАВИЛ КОДА В МОЮ ИГРУ, НО RUSTORY СОВЕРШЕННО ВСЕ РАВНО
    //Обновление:
    //1. При выходе из игры в меню, ресурсы сохраняются
    //2. Исправление орфографические ошибки
    //3. Изменения в цифры загрузки(теперь отсутствую цифры после запятой)
    //4. Теперь во время паузы, объекты больше не видно на экране
    //5. Предупреждение о том, с какой стороны будет появляться Астероид
    //6. Остановка музыки во время геймплея в космосе
}
